Revit 2027 API
ImporterIFCUtils Class
 A class that contains utilities needed to implement Revit's version of the IFC import client application.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.IFC.ImporterIFCUtils
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ImporterIFCUtils
Public NotInheritable Class ImporterIFCUtils
public ref class ImporterIFCUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ImporterIFCUtils = class end
The ImporterIFCUtils type exposes the following members.
Methods
Name | Description
CreateEmptyFamily |  Creates an empty family of a given category.
GetLocalFileName |  Get the local file name, including the path, corresponding to a linked IFC file. This will create a local copy of the IFC file if necessary.
UpdateDirectShapeCategory |  Updates the category of a DirectShape.
Top
Remarks
 This class contains special API utilities needed to enable the implementation of the client application for IFC import. Some of these utilities will be needed temporarily while the code for IFC import is migrated into the export client. These temporary interfaces are likely to change in upcoming Revit releases.
See Also
Reference
Autodesk.Revit.DB.IFC Namespace